allergen_lab/app/views/recipes/new.html.erb

SELECT "users".* FROM "users"
SELECT "ingredients".* FROM "ingredients"
---
<%= f.text_field :name%>
<%=f.collection_select :user_id, User.all, :id, :name%>

<%=f.collection_check_boxes :ingredient_ids, Ingredient.all, :id, :name%>